/**
 * p.108 01. 배열 정렬하기
 * 소요시간: 21m 35s
 * sort 사용법 까먹어서 이것저것 시도하다가 그냥 맨땅헤딩함 
 */

function solution(arr) {

    for(let i=0; i<arr.length; i++){
        if(arr[i]>arr[i+1]){
            let temp = arr[i];
            arr[i] = arr[i+1];
            arr[i+1] = temp;
        }
    }

    return arr;
    // return arr.map( (a,b) => a>b ? [a,b]=[b,a] : [a,b]=[a,b]);
    // 1, -5
    // [1, -5, 2, 4, 3]
    // [-5, 1, 2, 4, 3]

    // 1, 2
    // [-5, 1, 2, 4, 3]

    // 2, 4
    // [-5, 1, 2, 4, 3]

    // 4, 3
    // [-5, 1, 2, 3, 4]

    // [2, 1, 1, 3, 2, 5, 4]

    // (0) (1)
    // [2, 1, 1, 3, 2, 5, 4] 
    // [1, 2, 1, 3, 2, 5, 4] 

    // (1) (2)
    // [1, 1, 2, 3, 2, 5, 4]
    
    // (2) (3)
    // [1, 1, 2, 3, 2, 5, 4] 

    // (3) (4)
    // [1, 1, 2, 2, 3, 5, 4] 

};

console.log(solution([1, -5, 2, 4, 3])); // [-5, 1, 2, 3, 4]
console.log(solution([2, 1, 1, 3, 2, 5, 4])); // [1, 1, 2, 2, 3, 4, 5]
console.log(solution([1, 6, 7])); // [1, 6, 7]

