"""
여행
https://edu.codetree.ai/samsung-camp/class/439/learn/lecture/4805/curated-cards/mock-travel/description

내일 다시 풀기..
"""
# N개 구역 (1~N 번호)
# M개 무료 도로

# 무료 도로망
# 유료 도로망
# 이용중인 도로망 상태 0 무료 1 유료 2 두번째 유로

# - [x] 유로 도로망 A -> B로 변경햇다가 B->A로 돌아올수잇는지 -> X
# - [x] 만료되면 다른 도로망으로 못 옮기는지? -> X
# [?] 모든 케이스를 고려하여 최소 시간을 출력해야하는지, 아니면 이전 일자의 선택까지만 고려해야 하는지
#   -> 후자면 후자라고 썼겟지.. 애초에 시간순서로 사건이 일어난다고 써있고 코디는 예지능력이 업슴

# [?] 유로 도로망은 그러면 단방향인지?
# -> 굳이 양뱡향이라고 표현했고, 이제보니 200명령에서 x랑 y에 반드시 s가 포함되어 있다는 말이 없음.
# -> 안전하게 다른 s가 주어졌다는 전제로 코딩하기.
# -> 아니근데  "정해진 입구 구역에서부터 출발해야 하며, 각 도로망의 입구 구역은 정확히 1개입니다" 이거 단방향이란 소리 아닌가
# -> [!] 일단 그럼 '정해진 입구를 지나갔는지'를 체크하자

# 만료되었을 때 시간복잡도 터질것같은데...
# 다익스트라에서 여러 경우의수를 저장해야하낭
# 초기에 명령을 전부 받고,
# 야설마 플로이드냐 -> 생각해보니 유료망 15개가 최대라... 만료되면 걍 그때그때 업데이ㅡ해도 될듯

# 도로망 별 다익스트라!

# 숙소 변경이 있을 때마다
#     - 유로 선택 안함 -> 무료 유로 도로망 다익스트라 각각
#     - 유로 한 번 선택 -> 유료들 다익스트라 각각
#     - 유로 두 번 선택 -> 그 유로만 다익스트라


# 티켓 구매
#     - 다익스~
#     - 이미 유료 도로망 두 번 사용한 경우에는, 굳이 업데이트 하지 않음
# 티켓 만료
#     - 유료 다익스트라에서 만료시점 고려할 방법 없나? 아니 ㅁㅊ 만료되어봤자 15번 이내구나 그럼 그냥 다익스 다시 돌리자
#     - 해당 도로망만 다익스 다시 돌리기


# 여행
#     -
# 최단경로 다익스트라 O(정점log(간선))
# - 우선순위 큐
# - 꺼내는 순간 확정
# - 다음 지역이 비용 확정되어 있을 경우 넘어감
# - 아닐 경우, 비용이 작으면 업데이트
# for Q일
#     1. 여행할 나라 정하기 (1)
#         - 100 N M s x y w x y w ...
#         - 무료 도로, 양방향
#         - 숙소 s, 매일 여행을 마치면 s로 돌아옴
#     2. 도로망 이용 티켓 구매 (15)
#         - 200 M s x y w x y w ...
#         - 유로 도로, 양방향
#         - 건설 회사의 티켓 필요
#         - 만료 후 사용 불가
#         - 정해진 입구 구역(s)에서 출발해야 함 -> 사실상 단방향 아닌지??
#         - 도로망 번후: 도로망 구매 순서대로 1부터
#             [!] 무료 도로망은 카운트하지 않음
#     3. 티켓 만료
#         - 300 k
#         - 도로망 만료 -> 이용 불가
#     4. 숙소 변경 (15)
#         - 400 s
#     5. 여행하기
#         - 유료 도로망 이용 전에는 무료 도로 이용 가능
#         - 유료 도로망 한 번이라도 이용하면, 무료 도로 불가
#         - 이용 중인 유료 도로망을 변경하는 것은 최대 한 번 가능
#         - [!]유로 도로망 이용하려면 해당 도로망의 시작 구역으로 이동해야 함!!
#         - 출력: 도착 구역까지 걸리는 최소 시간, 이동 불가하면 -1 출력
"""
# [!] 무료 도로망 이용중일땐 여행중 한 번쯤 유로로 갈 수 잇지 않을까? 유로 이용중일때도
# ㅁㅊ 그러면 무료 -> 유료 -> 유로 케이스 필요하겠네
# 온갖 방법 삽질하며 고민해보다가, 결국 그냥 다익스트라인데 꺼내는 순간 확정이 아니라, 비용 더 작은지를 고려하기로 함.. 도박인데 다른 방법이 없음 ㅠ


# - [x] 유로 도로망 A -> B로 변경햇다가 B->A로 돌아올수잇는지 -> X
# - [x] 만료되면 다른 도로망으로 못 옮기는지? -> X
# [?] 모든 케이스를 고려하여 최소 시간을 출력해야하는지, 아니면 이전 일자의 선택까지만 고려해야 하는지
#   -> 후자면 후자라고 썼겟지.. 애초에 시간순서로 사건이 일어난다고 써있고 코디는 예지능력이 업슴

# [?] 유로 도로망은 그러면 단방향인지?
# -> 굳이 양뱡향이라고 표현했고, 이제보니 200명령에서 x랑 y에 반드시 s가 포함되어 있다는 말이 없음. 
# -> 안전하게 다른 s가 주어졌다는 전제로 코딩하기.
# -> 아니근데  "정해진 입구 구역에서부터 출발해야 하며, 각 도로망의 입구 구역은 정확히 1개입니다" 이거 단방향이란 소리 아닌가
# -> [!] 일단 그럼 '정해진 입구를 지나갔는지'를 체크하자


N개 구역 (1~N 번호)
M개 무료 도로

숙소(출발지)

유료 사용 횟수: 0, 1, 2
도로망들 { } * 무료 0, 유로 1~
전체 도로 정보 {} # 시작 도로 { 끝 도로 { 도로망 번호: 비용 } }
전체_다익스트라_dp [[]] # 비용, 이용 도로망 정보

도로망
    - 도로망 번호 (0 국가, 1~ 건설 회사)
    - 숙소 기준 다익스트라 결과 (비용 리스트)
        - 무료 사용망: 무료+유로 최대 2개까지 고려한 다익스트라
    - 입구 정보: (무료일 경우, -1) 
    - 도로 정보{} 

# 전체_다익스트라_dp [[]] # 비용, 이용 도로망 정보
def 다익스트라_전체()
    - heapq: (비용 최소, 이전 도로망 정보{무료, 유료, 유료}, 최근 도로망, {이용 가능한  도로망})
    - 꺼내는 순간 확정이 아니라, 비용이 클 경우만 컨티뉴 
    - 유로 사용 현황에 따라 수집 범위와 제한이 다름
        - 유료 0회: 유무료 모두 
        - 유료 1회: 유료들만
        - 유료 2회: 그것만!
    - 다음 도로는 
    - 다음 도로에 대한 체크 항목: 
        - 최근 도로망이랑 같을 경우, 이동 가능
        - 다를 경우, 
            - 현재 무료에 있음(이전 도로망이): 유료 체크 후 가능
            - 현재 유료1에 있음: 무료는 못감, 다른 유료면, 입구 도로를 거쳤을 경우에만 가능
            - 현재 유료2에 있음: 안됨
            --> 최근 도로망 업뎃
        - 이 도시를 거치면 사용 가능한 도로망이 있을 경우, {이용 가능한 도로망} 업데이트
         


for Q일
    1. 여행할 나라 정하기 (1)
        - 100 N M s x y w x y w ...
        - 무료 도로, 양방향
        - 숙소 s, 매일 여행을 마치면 s로 돌아옴
        - 전체 다익스 돌리기
    2. 도로망 이용 티켓 구매 (15)
        - 200 M s x y w x y w ...
        [!] 이미 유료 도로망 두 번 사용한 경우에는, 굳이 업데이트 하지 않음
        - 유로 도로, 양방향
        - 건설 회사의 티켓 필요
        - 만료 후 사용 불가
        - 정해진 입구 구역(s)에서 출발해야 함 -> 사실상 단방향 아닌지??
        - 도로망 번후: 도로망 구매 순서대로 1부터 
            [!] 무료 도로망은 카운트하지 않음
        - 전체 다익스 돌리기
    3. 티켓 만료
        - 300 k
        - 도로망 만료 -> 이용 불가
        - 도로망 제거
        - 전체 다익스 돌리기

    4. 숙소 변경 (15)
        - 400 s
        - 전체 다익스 돌리기
    5. 여행하기
        - 유료 도로망 이용 전에는 무료 도로 이용 가능
        - 유료 도로망 한 번이라도 이용하면, 무료 도로 불가
        - 이용 중인 유료 도로망을 변경하는 것은 최대 한 번 가능
        - [!]유로 도로망 이용하려면 해당 도로망의 시작 구역으로 이동해야 함!!
        - 출력: 도착 구역까지 걸리는 최소 시간, 이동 불가하면 -1 출력

# 1회독 및 예제케이스 이해 10m 24s
# 2회독 및 의문점 해결 18m 59s
# 알고리즘 및 구현방식 고만 48m 52s
# 구현 내용 정리...하다가 2차 고민 1h 28m 16s
# 테이블 작성 11m

"""
# 1회독 및 예제케이스 이해 10m 24s
# 2회독 및 의문점 해결 18m 59s
# 알고리즘 및 구현방식 고만 48m 52s
# 구현 내용 정리...하다가 2차 고민 1h 28m 16s
# 테이블 작성 11m

# [!] 무료 도로망 이용중일땐 여행중 한 번쯤 유로로 갈 수 잇지 않을까? 유로 이용중일때도
# ㅁㅊ 그러면 무료 -> 유료 -> 유로 케이스 필요하겠네
# 온갖 방법 삽질하며 고민해보다가, 결국 그냥 다익스트라인데 꺼내는 순간 확정이 아니라, 비용 더 작은지를 고려하기로 함.. 도박인데 다른 방법이 없음 ㅠ


# - [x] 유로 도로망 A -> B로 변경햇다가 B->A로 돌아올수잇는지 -> X
# - [x] 만료되면 다른 도로망으로 못 옮기는지? -> X
# [?] 모든 케이스를 고려하여 최소 시간을 출력해야하는지, 아니면 이전 일자의 선택까지만 고려해야 하는지
#   -> 후자면 후자라고 썼겟지.. 애초에 시간순서로 사건이 일어난다고 써있고 코디는 예지능력이 업슴

# [?] 유로 도로망은 그러면 단방향인지?
# -> 굳이 양뱡향이라고 표현했고, 이제보니 200명령에서 x랑 y에 반드시 s가 포함되어 있다는 말이 없음.
# -> 안전하게 다른 s가 주어졌다는 전제로 코딩하기.
# -> 아니근데  "정해진 입구 구역에서부터 출발해야 하며, 각 도로망의 입구 구역은 정확히 1개입니다" 이거 단방향이란 소리 아닌가
# -> [!] 일단 그럼 '정해진 입구를 지나갔는지'를 체크하자

from collections import defaultdict
import heapq

# N개 구역 (1~N 번호)
# M개 무료 도로
DEBUG = False
INF = float('inf')
Q = int(input())
N = -1 # 도시 수
S = -1 # 숙소(출발지)
K = 1 # 다음 도로망 번호
used = [0] # 이용 유로도로망 정보

tickets = {} # 티켓(도로망들) { } * 무료 0, 유로 1~
streets = defaultdict(defaultdict) # 전체 도로 정보 {} # 시작 도로 { 끝 도로 { 도로망 번호: 비용 } }
costs = [] # 전체 비용 맵 (전체 다익스트라 결과 맵) [[비용, 이용 도로망 정보]]

# 도로망
class Ticket:
    def __init__(self, t_id, s, graph):
        self.t_id = t_id # - 도로망 번호 (0 국가, 1~ 건설 회사)
        self.s = s # - 입구 정보: (무료일 경우, -1)
        self.graph = graph # - 도로 정보{시작: {끝: 비용}

# 전역 내용 작성 9m 40s

# # 전체_다익스트라_dp [[]] # 비용, 이용 도로망 정보
def update_cost_map():
    global costs

    cost_map = [[INF, list()] for _ in range(N+1)]

    # heapq: (비용 최소, 현재 도시, 이전 도로망 정보[무료, 유료, 유료] {방문 도시})
    q = [(INF, S, used[:], set())]

    while q:
        cost, cur_city, used_tickets, visited = heapq.heappop(q)
        cur_ticket = tickets[used_tickets[-1]]

        for next_city, next_city_info in streets[cur_city].items():
            for next_ticket, next_cost in next_city_info.items():
                new_cost = cost+next_cost
                # 비용이 같을 경우 업데이트 오류 발생 여지 있음
                if new_cost >=  cost_map[next_city][0] or next_city in visited: continue

                new_tickets = used_tickets
                new_visited = visited
                can_next = False

                # 최근 도로망이랑 같을 경우, 이동 가능
                if cur_ticket == next_ticket:
                    can_next = True
                # - 다를 경우,
                else:
                    # 현재 무료에 있음(이전 도로망이): 유료 체크 후 가능
                    if len(used_tickets) == 1: can_next = True
                    # 현재 유료1에 있음: 무료는 못감, 다른 유료면, 입구 도로를 거쳤을 경우에만 가능
                    elif len(used_tickets) == 2 and next_ticket != 0 and tickets[next_ticket].s in visited: can_next = True

                if can_next:
                    new_tickets = new_tickets[:] + [next_ticket]
                    new_visited = set(new_visited)
                    new_visited.add(next_city)
                    cost_map[next_city] = [new_cost, new_visited]
                    heapq.heappush(q, (new_cost, next_city, new_tickets, new_visited))

    costs = cost_map
# 전체 도로 정보 업데이트
# 도로 정보를 그래프로 변환하여 반환
def update_streets(line, m, t_id): # 33m 57s
    graph = defaultdict(defaultdict)

    for idx in range(m):
        x, y, w = line[idx*3:idx*3+3]
        graph[x][y] = w
        graph[y][x] = w

        if x not in streets:
            streets[x] = defaultdict(defaultdict)
            streets[y] = defaultdict(defaultdict)

        if y not in streets[x]:
            streets[x][y] = defaultdict(defaultdict)
            streets[y][x] = defaultdict(defaultdict)

        if t_id not in streets[x][y]: streets[x][y][t_id] = defaultdict(int)
        streets[x][y][t_id] = w
        streets[y][x][t_id] = w

    return graph

def main():
    global N, S

    for _ in range(Q):
        line = list(map(int, input().split()))
        cmd = line[0]
        # ===========================================
        # 1. 여행할 나라 정하기
        # ===========================================
        if cmd == 100:
            N, m, S = line[1:4]
            # 도로 정보 업데이트
            # 도로망 정보를 그래프화
            g = update_streets(line[4:], m, 0)
            # 도로망 추가
            tickets[0] = Ticket(0, -1, g)
            update_cost_map()
            print()

            # - 무료 도로, 양방향
            # - 숙소 s, 매일 여행을 마치면 s로 돌아옴
            # - 전체 다익스 돌리기
        # 2. 도로망 이용 티켓 구매 (15)
        #     - 200 M s x y w x y w ...
        #     [!] 이미 유료 도로망 두 번 사용한 경우에는, 굳이 업데이트 하지 않음
        #     - 유로 도로, 양방향
        #     - 건설 회사의 티켓 필요
        #     - 만료 후 사용 불가
        #     - 정해진 입구 구역(s)에서 출발해야 함 -> 사실상 단방향 아닌지??
        #     - 도로망 번후: 도로망 구매 순서대로 1부터
        #         [!] 무료 도로망은 카운트하지 않음
        #     - 전체 다익스 돌리기
        # 3. 티켓 만료
        #     - 300 k
        #     - 도로망 만료 -> 이용 불가
        #     - 도로망 제거
        #     - 전체 다익스 돌리기
        #
        # 4. 숙소 변경 (15)
        #     - 400 s
        #     - 전체 다익스 돌리기
        # 5. 여행하기
        #     - 유료 도로망 이용 전에는 무료 도로 이용 가능
        #     - 유료 도로망 한 번이라도 이용하면, 무료 도로 불가
        #     - 이용 중인 유료 도로망을 변경하는 것은 최대 한 번 가능
        #     - [!]유로 도로망 이용하려면 해당 도로망의 시작 구역으로 이동해야 함!!
        #     - 출력: 도착 구역까지 걸리는 최소 시간, 이동 불가하면 -1 출력

main()
